//
//  GuidebookView.swift
//  firstXcode
//
//  Created by Juman Dhaher on 23/03/1445 AH.
//

import SwiftUI

struct GuidBookView: View{
    var body:some View{
        NavigationView{
            ScrollView{
            
                    Text("""
            سياسة نظام الحضور والانصراف
            
            • على المتدربة الحضور في الوقت المحدد حسب الجدول مع تأدية المهام المطلوبة خلال أيام الأسبوع من يوم الأحد إلى يوم الخميس من 9:00 صباحاً -01:00 مساءً أو من 02:00 مساءً حتى 06:00 مساءً باستثناء الإجازات الرسمية. ويجب إحاطة المنسق الطلابي والمرشد الشخصي عند الغياب لظروف قاهرة.\n
            • يجب على المتدربة تسجيل الدخول لاحتساب الحضور بمجرد الدخول لمبنى الأكاديمية، وعند التأخر ١٥ دقيقة في تسجيل الدخول سيتم تلقائياً احتساب تأخير المتدربات.\n
            • يتم احتساب الحضور والغياب أيام ورش العمل واللقاءات بتواجد المتدربة في مقر الورشة أو اللقاء وسيتم احتساب غياب بدون عذر حال عدم التواجد.\n
            • الغياب المسموح للمتدربة بحد أقصى ١٥ يوم فقط خلال البرنامج من غير عذر رسمي.\n
            • تملك المتدربة رصيد استئذان ساعتين شهريًا يمكن استخدامها بعد إبلاغ المنسق الطلابي.\n
            • تطبق الإجازات الرسمية في الأكاديمية بما يتماشى مع أنظمة إجازات المملكة العربية السعودية في حالات الزوج والولادة والوفاة وغيرها.\n
            • تطبق الإجازات الرسمية للدولة في الأعياد والأيام الوطنية.\n
            • ينتقل التعليم عن بعد في حالات الطوارئ.\n
            • يتم احتساب الغياب بعذر في وقت الاختبارات في حال تعارض وقت الأكاديمية مع وقت الاختبار.\n
            • على المتدربة إبلاغ المنسق الطلابي عند الانضمام للأكاديمية بأي مشاكل أسرية أو صحية أو نفسية تعاني منها.\n
            • عند غياب المتدربة بسبب المرض أو المكوث في المستشفى أو لظروف قاهرة، فينبغي على المتدربة رفع الأعذار الرسمية، مع الإحاطة بأنه إذا تغيبت المتدربة ٥ أيام متتالية بدون إشعار للمنسق الطلابي سيتم اقصاءها مباشرة من البرنامج.\n
            • الوثائق المطلوبة:
            ١- المكوث في المستشفى - تقرير من منصة صحتي
            ٢- الظروف القاهرة - احضار مايثبت ذلك من تقارير رسمية
            ٣- فقدان أحد افراد الأسرة (الجدة-الجد-الوالدين-الأبناء-الأخوة) - نسخة من إبلاغ الوفاة من المستشفى أو الجهة المعنية + نسخة من بطاقة العائلة.\n
            - التحذيرات والإنذارات\n
            • يتم إرسال تنبيه أول للمتدربة عند تجاوز عدد أيام الغياب بدون عذر رسمي ٣ ايام متتالية.\n
            • يتم إرسال تنبيه ثاني للمتدربة عند تجاوز عدد أيام الغياب بدون عذر رسمي ١٠ ايام متفرقة.\n
            • يتم إرسال تحذير أخير للمتدربة عند تجاوز عدد أيام الغياب بدون رسمي ١٤ يوم.\n
            • يتم إقصاء المتدربة من الأكاديمية وحرمانها من استكمال البرنامج والحصول على الشهادة الأكاديمية عند تجاوز عدد أيام الغياب بدون عذر رسمي ١٥ يومًا.\n
            • يجب تقديم أعذار رسمية وتزويد المنسق الطلابي بالمستندات لاحتساب الغياب بعذر.\n
            • عند وصول عدد ساعات التأخير للمتدربة ٤ ساعات سيتم احتسابها كغياب يوم بدون عذر.\n
            • عند الخروج بدون تسجيل الانصراف سيتم احتساب ساعة تأخير.\n
            • للأكاديمية حق حرمان المتدربة من الشهادة الأكاديمية عند الغياب في جلسات مراجعة التطبيقات دون تقديم عذر رسمي (App Review)\n
            """)
            }.multilineTextAlignment(.trailing)
            
        }.padding().navigationTitle(Text("The Guide Book"))
    }
    
}



struct GuidBookView_Previews: PreviewProvider {
    static var previews: some View {
        GuidBookView().preferredColorScheme(.light)
        GuidBookView().preferredColorScheme(.dark)
    }
}

